Repository: master3395/YOURLS-Upload-and-Shorten
Catalog: l10n/upload-and-shorten-*.po
Languages: nb_no

source: Send a file to your webserver and create a short-URL for it.
nb_no: Send en fil til webserveren din og lag en kort-URL for den.

source: Select a file
nb_no: Velg en fil

source: YOURLS database options
nb_no: YOURLS database alternativer

source: Custom shortname:
nb_no: Tilpasset kortnavn:

source: Custom title:
nb_no: Tilpasset tittel:

source: Filename conversions (optional)
nb_no: Filnavn konverteringer (valgfritt)

source: No conversion
nb_no: Ingen konvertering

source: Filename will not be changed at all.
nb_no: Filnavnet vil ikke bli endret i det hele tatt.

source: Browser-safe filename
nb_no: Nettleser-sikkert filnavn

source: Recommended if the file should be accessed by web-browsers.
nb_no: Anbefalt hvis filen skal tilgås av nettlesere.

source: Randomize filename
nb_no: Tilfeldig filnavn

source: Browser-safe filenames with a slight protection against systematic crawling your web-directory.
nb_no: Nettleser-sikre filnavn med lett beskyttelse mot systematisk kravling av din web-mappe.

source: Drop extension
nb_no: Fjern utvidelse

source: Hide the filetype. Can be combined with above options.
nb_no: Skjul filtypen. Kan kombineres med ovennevnte alternativer.

source: Some webservers won't send correct headers and web-browsers may not handle the file correctly.
nb_no: Noen webservere sender ikke korrekte headers og nettlesere kan ikke håndtere filen riktig.

source: Go!
nb_no: Gå!

source: This plugin is hosted at
nb_no: Dette plugin er hostet på

source: If you like it, remember someone spends his time working on it.
nb_no: Hvis du liker det, husk at noen bruker sin tid på å jobbe med det.

source: A cup of coffee might stimulate further improvements. ;-)
nb_no: En kopp kaffe kan stimulere til videre forbedringer. ;-)

source: You need to select a file to upload.
nb_no: Du må velge en fil å laste opp.

source: successfully sent. These are the links to your file:
nb_no: sendt vellykket. Dette er lenkene til filen din:

source: Direct:
nb_no: Direkte:

source: Short:
nb_no: Kort:

source: Upload failed, sorry! The error was
nb_no: Opplasting feilet, beklager! Feilen var

source: Storage Locations
nb_no: Lagringsplasseringer

source: File Expiration
nb_no: Fil utløp

source: Upload Limits
nb_no: Opplastingsgrenser

source: Frontend Settings
nb_no: Frontend innstillinger

source: Storage location
nb_no: Lagringsplassering

source: Expiration Period
nb_no: Utløpsperiode

source: Never
nb_no: Aldri

source: 24 hours
nb_no: 24 timer

source: 7 days
nb_no: 7 dager

source: 31 days
nb_no: 31 dager

source: 90 days
nb_no: 90 dager

source: Custom
nb_no: Tilpasset

source: Custom Days
nb_no: Tilpassede dager

source: Maximum File Size (MB)
nb_no: Maksimal filstørrelse (MB)

source: Allowed File Types
nb_no: Tillatte filtyper

source: Blocked File Types
nb_no: Blokkerte filtyper

source: Enable Frontend Uploads
nb_no: Aktiver frontend opplastinger

source: Upload Page Message
nb_no: Opplastingsside melding

source: Require Authentication
nb_no: Krev autentisering

source: Rate Limit (uploads per hour)
nb_no: Hastighetsgrense (opplastinger per time)

source: Save Settings
nb_no: Lagre innstillinger

source: Uploaded Files
nb_no: Opplastede filer

source: Total Files
nb_no: Totalt antall filer

source: File
nb_no: Fil

source: Short URL
nb_no: Kort URL

source: Size
nb_no: Størrelse

source: Upload Date
nb_no: Opplastingsdato

source: Expires
nb_no: Utløper

source: Downloads
nb_no: Nedlastinger

source: Actions
nb_no: Handlinger

source: View
nb_no: Vis

source: Extend
nb_no: Forleng

source: Delete
nb_no: Slett

source: Copy
nb_no: Kopier

source: Copied!
nb_no: Kopiert!

source: Choose file or drag and drop
nb_no: Velg fil eller dra og slipp

source: Browse
nb_no: Bla gjennom

source: Custom URL
nb_no: Tilpasset URL

source: Custom Title
nb_no: Tilpasset tittel

source: Keep Original
nb_no: Behold original

source: Remove unsafe characters for web browsers
nb_no: Fjern usikre tegn for nettlesere

source: Generate random filename for privacy
nb_no: Generer tilfeldig filnavn for personvern

source: Hide File Extension
nb_no: Skjul filutvidelse

source: Remove file extension from filename
nb_no: Fjern filutvidelse fra filnavn

source: Upload & Create Short URL
nb_no: Last opp og lag kort URL

source: Uploading...
nb_no: Laster opp...

source: File uploaded successfully!
nb_no: Fil lastet opp vellykket!

source: Direct Link:
nb_no: Direkte lenke:

source: Short URL:
nb_no: Kort URL:

source: Error:
nb_no: Feil:

source: Success:
nb_no: Suksess:

source: Warning:
nb_no: Advarsel:

source: Loading...
nb_no: Laster...

source: Security check failed
nb_no: Sikkerhetssjekk feilet

source: Please select a file to upload
nb_no: Vennligst velg en fil å laste opp

source: Failed to create short URL
nb_no: Kunne ikke lage kort URL

source: Failed to save file
nb_no: Kunne ikke lagre fil

source: Upload processing failed
nb_no: Opplastingsbehandling feilet

source: Frontend uploads are disabled
nb_no: Frontend opplastinger er deaktivert

source: Authentication required
nb_no: Autentisering påkrevd

source: Rate limit exceeded
nb_no: Hastighetsgrense overskredet

source: No file uploaded
nb_no: Ingen fil lastet opp

source: Invalid URL format
nb_no: Ugyldig URL format

source: URL already exists
nb_no: URL finnes allerede

source: URL created successfully
nb_no: URL opprettet vellykket

source: URL creation failed
nb_no: URL opprettelse feilet

source: Keyword cannot be empty
nb_no: Nøkkelord kan ikke være tomt

source: Keyword must be between 1 and 200 characters
nb_no: Nøkkelord må være mellom 1 og 200 tegn

source: Keyword can only contain letters, numbers, hyphens, and underscores
nb_no: Nøkkelord kan bare inneholde bokstaver, tall, bindestrek og understreker

source: Keyword is already taken
nb_no: Nøkkelord er allerede tatt

source: Keyword is reserved
nb_no: Nøkkelord er reservert

source: File type not allowed
nb_no: Filtype ikke tillatt

source: File size exceeds maximum allowed size
nb_no: Filstørrelse overskrider maksimal tillatt størrelse

source: File is empty
nb_no: Fil er tom

source: Could not determine file type
nb_no: Kunne ikke bestemme filtype

source: File type mismatch
nb_no: Filtype samsvarer ikke

source: Executable files are not allowed
nb_no: Kjørbare filer er ikke tillatt

source: PHP files are not allowed
nb_no: PHP filer er ikke tillatt

source: File contains PHP code
nb_no: Fil inneholder PHP kode

source: File contains script tags
nb_no: Fil inneholder script tags

source: File appears to be executable
nb_no: Fil ser ut til å være kjørbar

source: Could not read file for content validation
nb_no: Kunne ikke lese fil for innholdsvalidering

source: File was not uploaded properly
nb_no: Fil ble ikke lastet opp riktig

source: Could not create storage directory
nb_no: Kunne ikke opprette lagringsmappe

source: Failed to move uploaded file
nb_no: Kunne ikke flytte opplastet fil

source: Failed to store file record
nb_no: Kunne ikke lagre filpost

source: Settings saved successfully!
nb_no: Innstillinger lagret vellykket!

source: Failed to save settings
nb_no: Kunne ikke lagre innstillinger

source: No files found.
nb_no: Ingen filer funnet.

source: Are you sure you want to delete this file?
nb_no: Er du sikker på at du vil slette denne filen?

source: Are you sure you want to perform this action?
nb_no: Er du sikker på at du vil utføre denne handlingen?

source: Please select an action and files
nb_no: Vennligst velg en handling og filer

source: Enter number of days to extend:
nb_no: Skriv inn antall dager å forlenge:

source: Bulk Actions
nb_no: Massehandlinger

source: Extend Expiration
nb_no: Forleng utløp

source: Delete Files
nb_no: Slett filer

source: Apply
nb_no: Bruk

source: Previous
nb_no: Forrige

source: Next
nb_no: Neste

source: All Files
nb_no: Alle filer

source: Active
nb_no: Aktiv

source: Expired
nb_no: Utløpt

source: Expiring Soon
nb_no: Utløper snart

source: Filter
nb_no: Filtrer

source: Add Storage Location
nb_no: Legg til lagringsplassering

source: Remove
nb_no: Fjern

source: Name
nb_no: Navn

source: Storage Path
nb_no: Lagringssti

source: Enabled
nb_no: Aktivert

source: Default Storage Location
nb_no: Standard lagringsplassering

source: Default Expiration Period
nb_no: Standard utløpsperiode

source: Number of days for custom expiration
nb_no: Antall dager for tilpasset utløp

source: Maximum file size allowed for uploads
nb_no: Maksimal filstørrelse tillatt for opplastinger

source: Comma-separated list of allowed file extensions (leave empty to allow all)
nb_no: Kommadelt liste over tillatte filutvidelser (la stå tom for å tillate alle)

source: Comma-separated list of blocked file extensions
nb_no: Kommadelt liste over blokkerte filutvidelser

source: Allow public users to upload files
nb_no: Tillat offentlige brukere å laste opp filer

source: Message displayed on the public upload page
nb_no: Melding vist på den offentlige opplastingssiden

source: Require users to be logged in to upload files
nb_no: Krev at brukere er logget inn for å laste opp filer

source: Maximum uploads per IP address per hour
nb_no: Maksimal antall opplastinger per IP-adresse per time

source: Full path to storage directory
nb_no: Full sti til lagringsmappe

source: Public URL to access files
nb_no: Offentlig URL for å få tilgang til filer

source: Web URL should end with a slash
nb_no: Web URL bør slutte med skråstrek

source: Storage path should end with a slash
nb_no: Lagringssti bør slutte med skråstrek

source: Path does not exist
nb_no: Sti finnes ikke

source: Path is not a directory
nb_no: Sti er ikke en mappe

source: Directory is not writable
nb_no: Mappe er ikke skrivbar

source: Path is valid and writable
nb_no: Sti er gyldig og skrivbar

source: Invalid web URL format
nb_no: Ugyldig web URL format

source: Storage location test completed (simulated)
nb_no: Lagringsplassering test fullført (simulert)

source: Storage location not found
nb_no: Lagringsplassering ikke funnet

source: Could not create or access storage directory
nb_no: Kunne ikke opprette eller få tilgang til lagringsmappe

source: Could not write test file
nb_no: Kunne ikke skrive testfil

source: Could not read test file
nb_no: Kunne ikke lese testfil

source: Total files
nb_no: Totalt antall filer

source: Total size
nb_no: Total størrelse

source: Available space
nb_no: Tilgjengelig plass

source: Upload files and get short URLs instantly!
nb_no: Last opp filer og få korte URLer øyeblikkelig!
